<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'ناو',
    'column.roles' => 'پلەکان',
    'column.permissions' => 'مۆڵەتەکان',
    'column.updated_at' => 'نوێکراوەتەوە لە',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'ناو',
    'field.permissions' => 'مۆڵەتەکان',
    'field.select_all.name' => 'دیاریکردنی هەموو',
    'field.select_all.message' => 'هەموو مۆڵەتەکان چالاک بکە کە لە ئێستادا چالاک کراون بۆ ئەم پلەیە',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'ڕێکخستنەکان',
    'nav.role.label' => 'پلەکان',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'پلە',
    'resource.label.roles' => 'پلەکان',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'بەشەکان',
    'resources' => 'بەشەکان',
    'widgets' => 'ویدجێتەکان',
    'pages' => 'پەڕەکان',
    'custom' => 'مۆڵەتە تایبەتییەکان',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'مۆڵەتت پێنەدراوە',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'بینین',
        'view_any' => 'بینینی هەموو',
        'create' => 'دروستکردن',
        'update' => 'نوێکردنەوە',
        'delete' => 'سڕینەوە',
        'delete_any' => 'سڕینەوەی بەکۆمەڵ',
        'force_delete' => 'سڕینەوەی بەهێز',
        'force_delete_any' => 'سڕینەوەی بەهێز بەکۆمەڵ',
        'restore' => 'گێڕانەوە',
        'reorder' => 'ڕیزکردن',
        'restore_any' => 'گێڕانەوەی بەکۆمەڵ',
        'replicate' => 'کۆپیکردن',
    ],
];
